from package_with_classes.ImageHandler import ImageHandler
from package_with_classes.ImageProcessor import ImageProcessor

images = []
Status = True
def print_menu():
    print("------------------------------------------------------------------------------")
    print("----------------------------------Меню----------------------------------------") 
    print("-----1. Загрузить изображение-------------------------------------------------") 
    print("-----2. Сохранить изображение-------------------------------------------------") 
    print("-----3. Изменить размерность изображения (300x300)----------------------------") 
    print("-----4. Применить фильтр размытия к изображению (Blur)------------------------") 
    print("-----5. Добавить текст в нижний правый угол изображения-----------------------") 
    print("-----6. Посмотреть список загруженных изображений-----------------------------") 
    print("-----7. Посмотреть изображение из списка загруженных изображений--------------") 
    print("-----8. Завершить программу---------------------------------------------------") 
    print("------------------------------------------------------------------------------")

def print_images(): 
    print("------------------------------------------------------------------------------")
    print()
    counter = 0 
    for image in images: 
        counter += 1 
        print(f"{counter}. {image.filename}") 
    print() 
    print("------------------------------------------------------------------------------")

while Status: 
    print_menu()
    input_data = input("Выберите номер желаемой операции: ")
    try: 
        input_data = int(input_data)
        if input_data < 1 or input_data > 8:
            print("------------------------------------------------------------------------------")
            print("------------Некорректный ввод, пожалуйста выберите число от 1 до 8------------")
            print("------------------------------------------------------------------------------")
            continue
    except ValueError: 
        print("------------------------------------------------------------------------------")
        print("----------Введенное вами значение должно быть числом. Попробуйте снова--------") 
        print("------------------------------------------------------------------------------")
        continue

    if input_data == 1: 
        input_data = input("Введите путь изображения, которое Вы хотели бы загрузить в память: ")
        try: 
            images.append(ImageHandler(input_data)) 
            images[-1].load_image()
            if images[-1].image:
                print("------------------------------------------------------------------------------")
                print("-----------------------Изображение успешно добавлено--------------------------") 
                print("------------------------------------------------------------------------------")
        except FileNotFoundError: 
            print("------------------------------------------------------------------------------")
            print("------------Файл не найден. Проверьте корректность введенных данных-----------") 
            print("------------------------------------------------------------------------------")

    elif input_data == 2: 
        print_images() 
        input_data = input("Выберите изображение, которое хотите сохранить: ") 
        try: 
            input_data = int(input_data) 
            name = input("Введите название сохраняемого изображения: ") 
            images[input_data - 1].save_image(name) 
            print("------------------------------------------------------------------------------")
            print("----------------------Изображение успешно сохранено---------------------------") 
            print("------------------------------------------------------------------------------")
        except (IndexError, ValueError): 
            print("------------------------------------------------------------------------------")
            print("-----Не удалось найти изображение. Проверьте корректность введенных данных----") 
            print("------------------------------------------------------------------------------")

    elif input_data == 3: 
        print_images() 
        input_data = input("Выберите изображение, размер которого Вы бы хотели изменить (300x300): ") 
        try: 
            input_data = int(input_data) 
            images[input_data - 1].resize_image((300, 300))
            print("-------------------------------------------------------------------------------")
            print("-----------------Размерность изображения была успешна изменена-----------------") 
            print("-------------------------------------------------------------------------------")
        except (IndexError, ValueError): 
            print("-------------------------------------------------------------------------------")
            print("------------Файл не найден. Проверьте корректность введенных данных------------") 
            print("-------------------------------------------------------------------------------")

    elif input_data == 4: 
        print_images() 
        input_data = input("Выберите изображение, к которому Вы бы хотели применить фильтр размытия: ") 
        try: 
            input_data = int(input_data) 
            processor = ImageProcessor(images[input_data - 1].image)
            processor.apply_filter('BLUR')
            images[input_data - 1].image = processor.image
            print("-------------------------------------------------------------------------------")
            print("------------------Фильтр размытия был применен к изображению-------------------") 
            print("-------------------------------------------------------------------------------") 
        except (IndexError, ValueError): 
            print("-------------------------------------------------------------------------------")
            print("------------Файл не найден. Проверьте корректность введенных данных------------") 
            print("-------------------------------------------------------------------------------")

    elif input_data == 5: 
        print_images() 
        input_data = input("Выберите изображение, в нижний правый угол которого Вы бы хотели добавить текст: ") 
        try: 
            input_data = int(input_data) 
            if input_data < 1 or input_data > len(images):
                print("-------------------------------------------------------------------------------")
                print("-Некорректный номер изображения. Пожалуйста, выберите существующее изображение-") 
                print("-------------------------------------------------------------------------------")
                continue
            text = input("Введите текст для добавления: ")
            processor = ImageProcessor(images[input_data - 1].image)
            processor.add_text(text)
            images[input_data - 1].image = processor.image
            print("-------------------------------------------------------------------------------")
            print("------Введенный вами текст был добавлен в нижний правый угол изображения-------") 
            print("-------------------------------------------------------------------------------")
        except (IndexError, ValueError): 
            print("-------------------------------------------------------------------------------")
            print("--------Текст не был добавлен. Проверьте корректность введенных данных---------") 
            print("-------------------------------------------------------------------------------") 

    elif input_data == 6: 
        print("-------------------------------------------------------------------------------") 
        print("----------------------Список загруженных изображений: -------------------------") 
        print_images() 
        print("-------------------------------------------------------------------------------") 

    elif input_data == 7: 
        print_images() 
        input_data = input("Выберите изображение, которое Вы хотели бы посмотреть: ") 
        try: 
            input_data = int(input_data) 
            images[input_data - 1].image.show()
        except (IndexError, ValueError): 
            print("-------------------------------------------------------------------------------")
            print("------------Файл не найден. Проверьте корректность введенных данных------------") 
            print("-------------------------------------------------------------------------------") 

    elif input_data == 8: 
        print("-------------------------------------------------------------------------------")
        print("---------------------Завершение выполнения программы---------------------------") 
        print("-------------------------------------------------------------------------------")  
        Status = False
